; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v12 ?v6)
             (pred_5 ?v5 ?v13)
             (pred_7 ?v12 ?v13)
             (pred_1 ?v11 ?v12 )
	     (pred_9 ?v12)
             (pred_3 ?v4)
             (pred_12 ?v5)
             (pred_11 ?v13)
             (pred_4 ?v12)
             (pred_10 ?v5)
             (pred_2 ?v12)
             (pred_6 ))



(:action op_5
:parameters (?v10 ?v7 ?v9 ?v1)
:precondition (and (pred_3 ?v10) (pred_3 ?v7) (pred_12 ?v9) (pred_11 ?v1)
          (pred_8 ?v10 ?v7) (pred_5 ?v9 ?v1)
                   (pred_7 ?v7 ?v1) (pred_9 ?v10) 
                   (pred_4 ?v7) (pred_10 ?v9))
:effect (and  (pred_2 ?v7) (not (pred_4 ?v7))))


(:action op_2
:parameters (?v10 ?v3)
:precondition (and (pred_3 ?v10) (pred_3 ?v3)
               (pred_9 ?v10) (pred_8 ?v10 ?v3) (pred_2 ?v3))
:effect (and (pred_9 ?v3) (not (pred_9 ?v10))))

(:action op_3
:parameters (?v10 ?v9)
:precondition (and (pred_3 ?v10) (pred_12 ?v9) 
                  (pred_9 ?v10) (pred_1 ?v9 ?v10) (pred_6 ))
:effect (and (pred_10 ?v9)
   (not (pred_1 ?v9 ?v10)) (not (pred_6 ))))


(:action op_4
:parameters (?v10 ?v2 ?v8)
:precondition (and (pred_3 ?v10) (pred_12 ?v2) (pred_12 ?v8)
                  (pred_9 ?v10) (pred_10 ?v8) (pred_1 ?v2 ?v10))
:effect (and (pred_10 ?v2) (pred_1 ?v8 ?v10)
        (not (pred_10 ?v8)) (not (pred_1 ?v2 ?v10))))

(:action op_1
:parameters (?v10 ?v9)
:precondition (and (pred_3 ?v10) (pred_12 ?v9) 
                  (pred_9 ?v10) (pred_10 ?v9))
:effect (and (pred_6 ) (pred_1 ?v9 ?v10) (not (pred_10 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_16 obj_02 obj_10 obj_07 obj_09 obj_14 obj_05 obj_04 obj_01 obj_20 obj_18 obj_21 obj_12 obj_17 obj_06
    obj_22 obj_03 obj_15
    obj_13 obj_11 obj_19
    )

    (:init
       (pred_6)

       (pred_3 obj_08)
       (pred_3 obj_16)
       (pred_3 obj_02)
       (pred_3 obj_10)
       (pred_3 obj_07)
       (pred_3 obj_09)
       (pred_3 obj_14)
       (pred_3 obj_05)
       (pred_3 obj_04)
       (pred_3 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_18)
       (pred_3 obj_21)
       (pred_3 obj_12)
       (pred_3 obj_17)
       (pred_3 obj_06)
       (pred_11 obj_22)
       (pred_11 obj_03)
       (pred_11 obj_15)
       (pred_12 obj_13)
       (pred_12 obj_11)
       (pred_12 obj_19)

       (pred_8 obj_08 obj_07)
       (pred_8 obj_08 obj_16)
       (pred_8 obj_16 obj_09)
       (pred_8 obj_16 obj_02)
       (pred_8 obj_16 obj_08)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_16)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_07 obj_04)
       (pred_8 obj_07 obj_09)
       (pred_8 obj_07 obj_08)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_09 obj_16)
       (pred_8 obj_09 obj_07)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_05 obj_18)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_04 obj_21)
       (pred_8 obj_04 obj_01)
       (pred_8 obj_04 obj_07)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_01 obj_20)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_01 obj_04)
       (pred_8 obj_20 obj_17)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_01)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_04)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_17 obj_20)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_06 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_10)
       (pred_4 obj_01)
       (pred_7  obj_18 obj_22)
       (pred_7  obj_10 obj_03)
       (pred_7  obj_01 obj_15)
       (pred_2 obj_08)
       (pred_2 obj_16)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_2 obj_09)
       (pred_2 obj_14)
       (pred_2 obj_05)
       (pred_2 obj_04)
       (pred_2 obj_20)
       (pred_2 obj_21)
       (pred_2 obj_12)
       (pred_2 obj_17)
       (pred_2 obj_06)

       (pred_5  obj_13 obj_22)
       (pred_5  obj_11 obj_03)
       (pred_5  obj_19 obj_15)
       (pred_1 obj_13 obj_12)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_19 obj_21)
       (pred_9 obj_14)
    )

    (:goal (and
       (pred_1 obj_13 obj_04)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_19 obj_01)
    ))
(:constraints
  (always (not (pred_9 obj_20)))
)
)

; plan
1. (op_2 obj_14 obj_09)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_09)
   goals met: 0 of 3
2. (op_2 obj_09 obj_07)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_07)
   goals met: 0 of 3
3. (op_2 obj_07 obj_04)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_04)
   goals met: 0 of 3
4. (op_2 obj_04 obj_21)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_21)
   goals met: 0 of 3
5. (op_2 obj_21 obj_12)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_12)
   goals met: 0 of 3
6. (op_3 obj_12 obj_13)
   deleted: (pred_1 obj_13 obj_12) (pred_6)
   added: (pred_10 obj_13)
   goals met: 0 of 3
7. (op_2 obj_12 obj_21)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_21)
   goals met: 0 of 3
8. (op_4 obj_21 obj_19 obj_13)
   deleted: (pred_10 obj_13) (pred_1 obj_19 obj_21)
   added: (pred_10 obj_19) (pred_1 obj_13 obj_21)
   goals met: 0 of 3
9. (op_2 obj_21 obj_12)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_12)
   goals met: 0 of 3
10. (op_5 obj_12 obj_01 obj_19 obj_15)
   deleted: (pred_4 obj_01)
   added: (pred_2 obj_01)
   goals met: 0 of 3
11. (op_1 obj_12 obj_19)
   deleted: (pred_10 obj_19)
   added: (pred_6) (pred_1 obj_19 obj_12)
   goals met: 0 of 3
12. (op_2 obj_12 obj_17)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_17)
   goals met: 0 of 3
13. (op_2 obj_17 obj_06)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_06)
   goals met: 0 of 3
14. (op_3 obj_06 obj_11)
   deleted: (pred_1 obj_11 obj_06) (pred_6)
   added: (pred_10 obj_11)
   goals met: 0 of 3
15. (op_2 obj_06 obj_17)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_17)
   goals met: 0 of 3
16. (op_2 obj_17 obj_12)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_12)
   goals met: 0 of 3
17. (op_4 obj_12 obj_19 obj_11)
   deleted: (pred_10 obj_11) (pred_1 obj_19 obj_12)
   added: (pred_10 obj_19) (pred_1 obj_11 obj_12)
   goals met: 0 of 3
18. (op_2 obj_12 obj_01)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_01)
   goals met: 0 of 3
19. (op_1 obj_01 obj_19)
   deleted: (pred_10 obj_19)
   added: (pred_6) (pred_1 obj_19 obj_01)
   goals met: 1 of 3
20. (op_2 obj_01 obj_12)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_12)
   goals met: 1 of 3
21. (op_3 obj_12 obj_11)
   deleted: (pred_1 obj_11 obj_12) (pred_6)
   added: (pred_10 obj_11)
   goals met: 1 of 3
22. (op_2 obj_12 obj_21)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_21)
   goals met: 1 of 3
23. (op_4 obj_21 obj_13 obj_11)
   deleted: (pred_10 obj_11) (pred_1 obj_13 obj_21)
   added: (pred_10 obj_13) (pred_1 obj_11 obj_21)
   goals met: 1 of 3
24. (op_2 obj_21 obj_04)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_04)
   goals met: 1 of 3
25. (op_1 obj_04 obj_13)
   deleted: (pred_10 obj_13)
   added: (pred_6) (pred_1 obj_13 obj_04)
   goals met: 2 of 3
26. (op_2 obj_04 obj_21)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_21)
   goals met: 2 of 3
27. (op_3 obj_21 obj_11)
   deleted: (pred_1 obj_11 obj_21) (pred_6)
   added: (pred_10 obj_11)
   goals met: 2 of 3
28. (op_2 obj_21 obj_04)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_04)
   goals met: 2 of 3
29. (op_2 obj_04 obj_07)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_07)
   goals met: 2 of 3
30. (op_2 obj_07 obj_09)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_09)
   goals met: 2 of 3
31. (op_2 obj_09 obj_14)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_14)
   goals met: 2 of 3
32. (op_2 obj_14 obj_05)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_05)
   goals met: 2 of 3
33. (op_1 obj_05 obj_11)
   deleted: (pred_10 obj_11)
   added: (pred_6) (pred_1 obj_11 obj_05)
   goals met: 3 of 3
